# Обратная матрица
#Задачи на оптимизацию c использованием обратной матрицы

# легкий пример (http://mathprofi.ru/pravilo_kramera_matrichnyi_metod.htmlhttp://mathprofi.ru/pravilo_kramera_matrichnyi_metod.html)

#3x1 - 2x2+ 4x3 = 21
#3x1 + 4x2 - 2x3 = 9
#2x1 - x2 - x3 = 10

# запишем выражения в виде матриц 

a <- c(3,3,2,-2,4,-1,4,-2,-1)
a <- matrix(a,3,3)
a

#x <- c("x1","x2","x3")
#x <- matrix(x,3,1)
#x

b <- c(21,9,10)
b <- matrix(b,3,1)
b

x <- solve(a) %*% b
x

####################################################################################
####################################################################################
